/*****************************************************************************
*  项目名称  ： 定时器T3中断方式
*    作者    ： 郑朋桥
*    时间    ： 2016/08/03
******************************************************************************/

/*****************************************************************************
*  添加头文件
******************************************************************************/
#include <ioCC2530.h>
#include "LED.h"
#include "INTTIME.h"
int led1Status = 0;
int count1 = 0;

/*****************************************************************************
*  函数介绍  ： 不精确延时函数
*            ： 
*    参数    ： 毫秒数
*   返回值   ： 无
******************************************************************************/
void delayMS(int ms)
{
  int i,j;
  for(i = 0; i < ms; i++)
  {
    for(j = 0; j < 535; j++);
  }
}



int T1_fun()
{
  if(count1++ > 2)
  {
    led1Status = !led1Status;
    count1 = 0;
  }
  return 0;
}

void main()
{  
  ledInit();

  initTime1(TIME1_CLOCK_DIV_128,TIME1_FREERUNNING,TIME1_CH_0);  
  //setT1CCxValue(254,TIME1_CH_0);
  setINTTime1Fun(T1_fun);
  while(1)
  {
    if(led1Status)
    {
      led1On(1);
    }
    else
    {
      led1Off(1);
    }
  }
}
