/******************************************************************************
* 项目名称 ：流水灯实验
* 作者 ：郑朋桥
* 时间 ： 2016/07/31
******************************************************************************/
#include <ioCC2530.h>
#include "LED.h"

/*****************************************************************************
*函数声明
*****************************************************************************/
void magicfun1();
void delayMS(int ms);

/*****************************************************************************
*对相应led的操作函数的结构体
*****************************************************************************/
typedef struct ledFunc{
    int led;          //led的序号
    void (*ledOn)();  //函数指针
    void (*ledOff)(); //函数指针
}LedfunctionArray;

LedfunctionArray ledfunArray[]={
  1,led1On,led1Off,   //对应led1的开关函数
  2,led2On,led2Off,
  3,led3On,led3Off,
};

/*****************************************************************************
*led流水特效的函数的结构体
*****************************************************************************/
typedef struct magicFun{
    int num;          //特效的序号
    void (*fun)();    //特效序号对应的函数
}magicLed;

magicLed  magicLedArray[] = {
 1,magicfun1,        //1特效的序号和函数
};

void magicfun1()    //使用Led的序列函数实现的特效函数
{
  ledfunArray[0].ledOn();
  delayMS(500);
  ledfunArray[0].ledOff();
  ledfunArray[1].ledOn();
  delayMS(500);
  ledfunArray[1].ledOff();
  ledfunArray[2].ledOn();
  delayMS(500);
  ledfunArray[2].ledOff();
}

/*****************************************************************************
*函数含义：不精确延迟函数
*函数参数：延迟毫秒数
*  返回值：无返回值
*****************************************************************************/
void delayMS(int ms)
{
  int i,j;
  for(i = 0; i < ms; i++)
  {
    for(j = 0; j < 535; j++);
  }
}


void main()
{
  ledInit();    //初始化LED
  
  while(1)      
  {
    magicLedArray[0].fun();   //显示特效表中的第一个特效
  }
}