/*****************************************************************************
*  项目名称  ： 敲击传感器模块/水银开关/光敏温敏传感器/触摸传感器模块/倾斜实验
*            ： 寻迹模块/震动模块/数字端的火焰传感器
*    作者    ： 郑朋桥
*    时间    ： 2016/08/10
******************************************************************************/

/*****************************************************************************
*  添加头文件
******************************************************************************/
#include "ioCC2530.h"
#include "LED.h"

#define DATA_PIN P0_4      //定义P0.7口为传感器的输入端

void pinInit()
{
  P0SEL &= ~(1 << 4);
  P0DIR &= ~(1 << 4);
}
void main()
{
  ledInit();
  pinInit();
  while(1)
  {
    
    if(DATA_PIN == 1)
    {        
         led2On();
    }
    else
    {
         led2Off();
    }
  }
    
}

