/*****************************************************************************
*  项目名称  ： 系统睡眠唤醒-中断唤醒
*    作者    ： 郑朋桥
*    时间    ： 2016/08/07
******************************************************************************/


/*****************************************************************************
*  添加头文件
******************************************************************************/
#include <ioCC2530.h>
#include "LED.h"
#include "INTKEY.h"
#include "SYSPOWER.h"


/*****************************************************************************
*函数含义：不精确延迟函数
*函数参数：延迟毫秒数
*  返回值：无返回值
*****************************************************************************/
void delayMS(int ms)
{
  int i,j;
  for(i = 0; i < ms; i++)
  {
    for(j = 0; j < 535; j++);
  }
}


void K1_fun(void)
{
  sysPowerMode(ACTICE_IDLE);   //唤醒睡眠
}


void ledSpangled()  //小灯闪烁
{
    led1On();
    delayMS(500);
    led1Off();
    delayMS(500);
    led1On();
    delayMS(500);
    led1Off();
    delayMS(500);
    led1On();
    delayMS(500);
    led1Off();
    delayMS(500);
}

void main()
{
  intKeyInit();
  setIntKey1Fun( K1_fun );
  ledInit();
  
  while(1)
  {
    ledSpangled();
    sysPowerMode(POWER_MODE3);    //进入睡眠
  }
    
}
