/*****************************************************************************
*  项目名称  ： 继电器模块
*    作者    ： 郑朋桥
*    时间    ： 2016/08/10
******************************************************************************/

/*****************************************************************************
*  添加头文件
******************************************************************************/
#include "ioCC2530.h"
#include "LED.h"
#include "INTKEY.h"

#define DATA_PIN P0_7        //定义P0.7口为传感器的输入端

void pinInit()
{
  P0SEL &= ~(1 << 7);
  P0DIR |= (1 << 7);
}

void KEY1_fun(void)
{
  DATA_PIN = 1;
  led1On();
}

void KEY2_fun(void)
{
  DATA_PIN = 0;
  led1Off();
}


void main()
{
  ledInit();
  intKeyInit();
  pinInit();
  setIntKey1Fun(KEY1_fun);
  setIntKey2Fun(KEY2_fun);
  while(1)
  {
   
  }
}

